Revit 2024 API
BuiltInFailures.DimensionFailures.DimensionUnequaled Property
 Dimension had to be unlocked and un-EQed in order to remove sketch over-constraining.
Namespace: Autodesk.Revit.DB
Assembly: RevitAPI (in RevitAPI.dll) Version: 24.0.0.0 (24.0.0.0)
Syntax
C#
public static FailureDefinitionId DimensionUnequaled { get; }
Visual Basic
Public Shared ReadOnly Property DimensionUnequaled As FailureDefinitionId
	Get
Visual C++
public:
static property FailureDefinitionId^ DimensionUnequaled {
	FailureDefinitionId^ get ();
}
See Also
BuiltInFailures.DimensionFailures Class
Autodesk.Revit.DB Namespace